#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураПараметров = Новый Структура("Адрес, Описание", Адрес, Описание);
	ОповеститьОВыборе(СтруктураПараметров);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВыделенныйТекс") Тогда
		Элементы.ДекорацияВыделенныйТекст.Заголовок = Параметры.ВыделенныйТекс;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	Элементы.Земетка.Видимость = НавигационнаяСсылка;
КонецПроцедуры
#КонецОбласти
