#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураПараметров = Новый Структура("Адрес, Описание", Адрес, Описание);
	ОповеститьОВыборе(СтруктураПараметров);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВыделенныйТекс") Тогда
		Элементы.ДекорацияВыделенныйТекст.Заголовок = Параметры.ВыделенныйТекс;
	КонецЕсли;
	Элементы.Земетка.Видимость = флНавигационнаяСсылка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	Элементы.Земетка.Видимость = флНавигационнаяСсылка;
КонецПроцедуры

&НаКлиенте
Процедура ЗеметкаПриИзменении(Элемент)
	Адрес 		= ПолучитьНавигационнуюСсылку(Земетка);
	Описание 	= Элементы.ДекорацияВыделенныйТекст.Заголовок;
КонецПроцедуры
#КонецОбласти
