
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗаполнятьАвтоматическиПриИзменении(Элемент)
	ЗаполнятьАвтоматическиПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнятьАвтоматическиПриИзмененииНаСервере()
	Если Объект.ЗаполнятьАвтоматически Тогда
		Объект.Заметки.Очистить();
				
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Заметки.Ссылка КАК Заметка
			|ИЗ
			|	Справочник.Заметки КАК Заметки
			|ГДЕ
			|	Заметки.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.Заметки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти