
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	//Вставка нач страницы
	//добавление в нее элементов
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьАвтоматическиПриИзменении(Элемент)
	ЗаполнятьАвтоматическиПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура Дозаполнить(Команда)
	ДозаполнитьНаСервере();
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнятьАвтоматическиПриИзмененииНаСервере()
	Если Объект.ЗаполнятьАвтоматически Тогда
		Объект.Заметки.Очистить();
				
		Объект.Заметки.Загрузить(ПолучитьСписокЗаметок());
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблица.Заметка КАК ЗаметкаТЧ
		|ПОМЕСТИТЬ ВТ_ТекущиеЗаметки
		|ИЗ
		|	&ТЧ КАК ВременнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заметки.Ссылка КАК Заметка
		|ИЗ
		|	Справочник.Заметки КАК Заметки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущиеЗаметки КАК ВТ_ТекущиеЗаметки
		|		ПО Заметки.Ссылка <> ВТ_ТекущиеЗаметки.ЗаметкаТЧ
		|ГДЕ
		|	Заметки.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Тема", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТЧ"	, Объект.Ссылка.Заметки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.Заметки.Добавить();
		НоваяСтрока.Заметка = ВыборкаДетальныеЗаписи.Заметка;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокЗаметок()
	
	Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Заметки.Ссылка КАК Заметка
			|ИЗ
			|	Справочник.Заметки КАК Заметки
			|ГДЕ
			|	Заметки.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Объект.Ссылка);
		
		ТаблицаЗаметок = Запрос.Выполнить().Выгрузить();
		
	Возврат ТаблицаЗаметок;
КонецФункции


#КонецОбласти