
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	//Вставка нач страницы
	//добавление в нее элементов
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьАвтоматическиПриИзменении(Элемент)
	ЗаполнятьАвтоматическиПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Процедура Дозаполнить(Команда)
	ДозаполнитьНаСервере();
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнятьАвтоматическиПриИзмененииНаСервере()
	Если Объект.ЗаполнятьАвтоматически Тогда
		Объект.Заметки.Очистить();				
		Объект.Заметки.Загрузить(ПолучитьСписокЗаметок());		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьНаСервере()
	
	ТаблицаЗаметок = ПолучитьСписокЗаметок();
	
	Для Каждого СтрокаТаб Из ТаблицаЗаметок Цикл
		Если Объект.Заметки.НайтиСтроки(Новый Структура("Заметка", СтрокаТаб.Заметка)).Количество() = 0 Тогда
			НоваяСтрока = Объект.Заметки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокЗаметок()
	
	Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Заметки.Ссылка КАК Заметка
			|ИЗ
			|	Справочник.Заметки КАК Заметки
			|ГДЕ
			|	Заметки.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Объект.Ссылка);
		
		ТаблицаЗаметок = Запрос.Выполнить().Выгрузить();
		
	Возврат ТаблицаЗаметок;
КонецФункции

#КонецОбласти