
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	 Если ОбменДанными.Загрузка
        Тогда Возврат;
    КонецЕсли;
	КомандаBase64ДанныеСервер();
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КомандаBase64ДанныеСервер() Экспорт
	ДвоичныеДанные 	= ФайлХранилище.Получить();
	Base64Данные 	= Base64Строка(ДвоичныеДанные);
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
