
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Base64Данные) Тогда
		КомандаBase64ДанныеНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаBase64Данные(Команда)
	КомандаBase64ДанныеНаСервере();	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КомандаBase64ДанныеНаСервере()
	ДвоичныеДанные 		= Объект.Ссылка.ФайлХранилище.Получить();
	Объект.Base64Данные = Base64Строка(ДвоичныеДанные);
КонецПроцедуры
#КонецОбласти