
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст", ВведенныйТекст);
		Если ПараграфФл Тогда
			СтруктураПараметров.Вставить("Тэг", ПредопределенноеЗначение("Справочник.Тэги.p"));
		Иначе
			Если Строка(ЗаголовокHTML) = "ур 1" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H1");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 2" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H2");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 3" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H3");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 4" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H4");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 5" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H5");
			ИначеЕсли Строка(ЗаголовокHTML) = "ур 6" Тогда
				Тэг = ПредопределенноеЗначение("Справочник.Тэги.H6");
			КонецЕсли;	
			СтруктураПараметров.Вставить("Тэг", Тэг);	
		КонецЕсли; 
			
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УстановитьВидимостьТэгов(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПараграфФлПриИзменении(Элемент)
	Если ПараграфФл Тогда
		 УстановитьВидимостьТэгов(Истина);
	Иначе
		 УстановитьВидимостьТэгов(Ложь);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокФлПриИзменении(Элемент)
	Если ЗаголовокФл Тогда
		 УстановитьВидимостьТэгов(Ложь);
	Иначе
		 УстановитьВидимостьТэгов(Истина);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьТэгов(Састояние)
	ПараграфФл 	= Састояние;
	ЗаголовокФл = Не Састояние;
	
	Элементы.Заголовок.Видимость 	= ЗаголовокФл;
	//Элементы.ЗаголовокФл.Видимость 	= ЗаголовокФл;
КонецПроцедуры

#КонецОбласти
