#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьКоличествоСтрокПолей() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
	КонецЕсли;
	
	Объект.ОсновнойТекст = СформироватьОсновнойТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура;
 	Структура.Вставить("ТекстДобавления", ВыбранноеЗначение.ВведенныйТекст);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	Структура.Вставить("Тэг"			, ВыбранноеЗначение.Тэг);
 	
 	ДобавитьСтрокуHTML(Структура); 
	
	Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();	
	
	Модифицированность 		= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВвестиТекст(Команда)
	СтрутураПараметров = Новый Структура;	
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаРедактирования", СтрутураПараметров, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЖирный(Команда)  	
	ИзменитьВыделенное("b");
КонецПроцедуры

&НаКлиенте
Процедура КомандаКурсив(Команда)	
	ИзменитьВыделенное("i");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодчеркнутый(Команда)
	ИзменитьВыделенное("s");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьВыделенное(Символ)
	Док				= Элементы.ОсновнойТекст.document;
	Выделение		= Док.getSelection();
	
	Если Не Выделение.focusNode = Неопределено Тогда  
		ВыделенныйТекст = Выделение.focusNode.textContent;
		НомерСтроки 	= Выделение.focusNode.parentElement.id; 
		Если НЕ НомерСтроки = "" Тогда 
			elem 			= Док.getElementById(НомерСтроки);	
			НужнаяСтрока 	= Объект.Поля.Получить(НомерСтроки-1);   
			тестСтроки      = НужнаяСтрока.Значение;  
			текстДляЗамены  = "<"+Символ+">" + ВыделенныйТекст + "</"+Символ+">";
			тестСтроки 		= СтрЗаменить(тестСтроки, ВыделенныйТекст,текстДляЗамены);    
			
			НужнаяСтрока.Значение 	= тестСтроки;  			
			Модифицированность 		= Истина;			
			Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();   
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерСтрокиДляВставки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("Значение", "</body>");
	 
	ПоискБоди = Объект.Поля.НайтиСтроки(Отбор);
	
	Если ПоискБоди = Неопределено Тогда
		НомерСтроки = ПолучитьКоличествоСтрокПолей();
	Иначе
		НомерСтроки = ПоискБоди[0].НомерСтроки	
	КонецЕсли;			
	
	Возврат НомерСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСтрокПолей()
	Возврат Объект.Поля.Количество();
КонецФункции

 &НаСервере
 Процедура ДобавитьНачальнуюСтраницуHTML()
 	Структура = Новый Структура;
 	
 	Структура.Вставить("Вставка", Ложь);
 	
 	Структура.Вставить("ТекстДобавления", "<!DOCTYPE html>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<html lang=""ru"">");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	ТекстДобавления = ДобавитьHead();
 		
 	Структура.Вставить("ТекстДобавления", ТекстДобавления);
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</html>");
 	ДобавитьСтрокуHTML(Структура); 
 
 КонецПроцедуры
 
  &НаСервере
 Функция ДобавитьHead()
 	ТекстКоментария = "";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<meta charset=""UTF-8""" + ">";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</head>";
 	
 	Возврат ТекстКоментария; 
 КонецФункции
 
  &НаСервере
 Процедура ДобавитьСтрокуHTML(Структура)
 	Если Структура.Вставка Тогда
 		НоваяСтрока = Объект.Поля.Вставить(Структура.НомерСтроки)
 	Иначе	
 		НоваяСтрока = Объект.Поля.Добавить();	
 	КонецЕсли;
 	
 	НоваяСтрока.Значение = Структура.ТекстДобавления; 
 	НоваяСтрока.Тэг      = Структура.Тэг;
 КонецПроцедуры
 
  &НаСервере
Функция СформироватьОсновнойТекст()
	ОсновнойТекст = "";
	
	Для Каждого СтрокаТЧ Из Объект.Поля Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Тэг) Тогда
			ТекстДляВставки = "";
			
			текТэг 			= СтрокаТЧ.Тэг;
			ОдиночныйТэг 	= текТэг.Одиночный;
			
			Структура = Новый Структура();
			Структура.Вставить("Одиночный", 	ОдиночныйТэг);
			Структура.Вставить("Наименование", 	текТэг.Наименование);
			Структура.Вставить("Значение", 		СтрокаТЧ.Значение);
			Структура.Вставить("НомерСтроки", 	СтрокаТЧ.НомерСтроки);
			
			Если ОдиночныйТэг Тогда			
				ТекстДляВставки = ПолучитьТекстДляВставки_Одиночный(Структура);
			Иначе
				ТекстДляВставки = ПолучитьТекстДляВставки_Двойной(Структура);
			КонецЕсли;
			ОсновнойТекст = ОсновнойТекст + ТекстДляВставки;
		Иначе //Без тегов
			ОсновнойТекст = ОсновнойТекст + СтрокаТЧ.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОсновнойТекст;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Одиночный(Структура)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Картинка) Тогда	
//		Если ЭтоКартинка(СтрокаТЧ.Картинка.Расширение) Тогда			
//			ТекстДляВставки = ПолучитьТекстДляВставки_Картинки(СтрокаТЧ);
//		Иначе
//			ТекстДляВставки = "<p><a href=""path/to/file"">" + СтрокаТЧ.Картинка.Наименование + " (файл " + СтрокаТЧ.НомерСтроки + ")</a></p>"; //- файл
//		КонецЕсли;
//	Иначе
		ТекстДляВставки = "<" + Структура.Наименование + " >" + Структура.Значение; //не картинка 
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Двойной(Структура)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Якорь) Тогда
//		ТекстДляВставки = ПолучитьТекстдляВставки_Якорь(СтрокаТЧ);	
//	Иначе
		ТекстДляВставки = ПолучитьТекстДляВставки(Структура);
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки(Структура)
	ТекстДляВставки = "";
	
	ТекстВставки = СтрЗаменить(Структура.Значение,Символы.ПС ,"<br>");
	ТекстДляВставки =  
		"<" + Структура.Наименование 
		+ " id=" + Структура.НомерСтроки
		+ " style = 'margin-left: 40px';>"
		+ ТекстВставки 
		+ "</" 
		+ Структура.Наименование 
		+ ">";
	
	Возврат ТекстДляВставки
	
КонецФункции

#КонецОбласти

