#Область СлужебныеПроцедурыИФункции
Функция ПолучитьОсновнойТекстИзТаблицы(ТаблицаСтрок) Экспорт
	
	ОсновнойТекст = "";
	
	Для Каждого СтрокаТаб Из ТаблицаСтрок Цикл
		
		Структура = Новый Структура();
		Структура.Вставить("Тэг"			, СтрокаТаб.Тэг);
		Структура.Вставить("ОдиночныйТэг"	, СтрокаТаб.Тэг.Одиночный);
		Структура.Вставить("Картинка"		, СтрокаТаб.Картинка);
		Структура.Вставить("Ширина"			, СтрокаТаб.Ширина);
		Структура.Вставить("Высота"			, СтрокаТаб.Высота);
		Структура.Вставить("ТэгНаименование", СтрокаТаб.Тэг.Наименование);
		Структура.Вставить("Значение"		, СтрокаТаб.Значение);
		Структура.Вставить("НомерСтроки"	, СтрокаТаб.НомерСтроки);
		
		//++ Формируем текст html, для каждой строки
		ТекстДляВставки = СформироватьТекстДляВставки(Структура);
		ОсновнойТекст = ОсновнойТекст + ТекстДляВставки;
	КонецЦикла;
	
	Возврат ОсновнойТекст;
	
КонецФункции 

Функция СформироватьТекстДляВставки(СтруктураТЧ)

	ТекстДляВставки = "";

	Если ЗначениеЗаполнено(СтруктураТЧ.Тэг) Тогда

		Если СтруктураТЧ.ОдиночныйТэг Тогда
			ТекстДляВставки = ПолучитьТекстДляВставки_Одиночный(СтруктураТЧ);
		Иначе
			ТекстДляВставки = ПолучитьТекстДляВставки_Двойной(СтруктураТЧ);
		КонецЕсли;
	Иначе //Без тегов
		ТекстДляВставки = СтруктураТЧ.Значение;
	КонецЕсли;

	Возврат ТекстДляВставки;
КонецФункции

Функция ПолучитьТекстДляВставки_Одиночный(Структура)
	Если ЗначениеЗаполнено(Структура.Картинка) Тогда	
		Если Структура.ТэгНаименование	= "img" Тогда			
			ТекстДляВставки = ПолучитьТекстДляВставки_Картинки(Структура);
		Иначе
			ТекстДляВставки = "<p><a href=""path/to/file"">" + Структура.Значение + " (файл " + Структура.НомерСтроки + ")</a></p>"; //- файл
		КонецЕсли;
	Иначе
		ТекстДляВставки = "<" + Структура.ТэгНаименование + " >" + Структура.Значение; //не картинка 
	КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

Функция ПолучитьТекстДляВставки_Картинки(Структура)
					
	//3-й способ вывести картинку					
	ТекстДляВставки = "";

	Base64Данные 	= Структура.Картинка.Base64Данные;

	Ширина 	= "350";
	Высота 	= "450";
	Высота 	= ?(Структура.Высота = 0, Высота, Структура.Высота);
	Ширина 	= ?(Структура.Ширина = 0, Ширина, Структура.Ширина);
	
	 
	СтрокаВставкиРазмера = "' width='"+Ширина+"' height='"+Высота+"'>";
	ТекстДляВставки = "<p></p>";
	ТекстДляВставки = ТекстДляВставки + "<img src='data:image/;base64," + Base64Данные + СтрокаВставкиРазмера;
   //ТекстДляВставки = ТекстДляВставки + "<img src='data:image/;base64," + Base64Данные+"'>";
	
	ТекстДляВставки = СтрЗаменить(ТекстДляВставки, "'>", "'  style = 'margin-left: 40px'>");
	
	Возврат ТекстДляВставки;
	
КонецФункции

Функция ПолучитьТекстДляВставки_Двойной(Структура)

	//добвим css style и id
	ТекстДляВставки = ПолучитьТекстДляВставкиФормата(Структура);
	
	Возврат ТекстДляВставки;
КонецФункции

Функция ПолучитьТекстДляВставкиФормата(Структура)
	ТекстДляВставки = "";
	
	ТекстВставки = СтрЗаменить(Структура.Значение,Символы.ПС ,"<br>");
	ТекстДляВставки =  
		"<" + Структура.ТэгНаименование 
		+ " id=" + Структура.НомерСтроки
		+ " style = 'margin-left: 40px';>"
		+ ТекстВставки 
		+ "</" 
		+ Структура.ТэгНаименование 
		+ ">";
	
	Возврат ТекстДляВставки
	
КонецФункции
#КонецОбласти