
&НаСервере
Процедура СоздатьТаблицуНаСервере()
		
	// Описание таблицы значений как реквизита
    МассивТипа = Новый Массив;
    МассивТипа.Добавить(Тип("ТаблицаЗначений"));
    
    ОписаниеТипа = Новый ОписаниеТипов(МассивТипа);
    МассивРеквизитовФормы = Новый Массив;
    МассивРеквизитовФормы.Добавить(Новый РеквизитФормы("ТаблицаДляВставки", ОписаниеТипа, "", "ТЗВставки"));
    
     КвалификаторыСтроки50 	= Новый КвалификаторыСтроки(50);   
     ОписаниеСтроки_50 		= Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки50);
     
     ТЗ = Новый ТаблицаЗначений;
     Для Каждого СтрСписка Из ТаблицаКолонок Цикл
     	ТЗ.Колонки.Добавить(СтрСписка.Имя, ОписаниеСтроки_50, СтрСписка.Заголовок);
     КонецЦикла;	
     
     Для Каждого Колонка Из ТЗ.Колонки Цикл
        МассивРеквизитовФормы.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДляВставки", Колонка.Заголовок));
     КонецЦикла;
     
    ЭлементТаблица = Элементы.Найти("ТаблицаДляВставки");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);
    Иначе
        ИзменитьРеквизиты(МассивРеквизитовФормы);
    КонецЕсли;
   
    ТаблицаПолейВыбора = Элементы.Добавить("ТЗВставки", Тип("ТаблицаФормы"));
    ТаблицаПолейВыбора.ПутьКДанным = "ТаблицаДляВставки";
    ТаблицаПолейВыбора.Отображение = ОтображениеТаблицы.Список;
    ТаблицаПолейВыбора.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
     
     Для Каждого Колонка Из ТЗ.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "ТаблицаДляВставки." + Колонка.Имя;
        НовыйЭлемент.Ширина = 50;
     КонецЦикла;
     
     ЗначениеВРеквизитФормы(ТЗ, "ТаблицаДляВставки");
     
     //	ТекущаяТаблица=РеквизитФормыВЗначение("ТаблицаСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТаблицу(Команда)
	СоздатьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МассивСтрок = Новый массив;

	Для Каждого СтрокаТаб Из ТаблицаКолонок Цикл
		Структура = Новый Структура;
		//Структура.Вставить("Имя", );
		
		МассивСтрок.Добавить(Структура);
	КонецЦикла;
//
	Структурапараметров = Новый структура;
//	Структурапараметров.вставить("вид", вид);
//	СтруктураПараметров.Вставить("Строки"	, МассивСтрок);
	
	ОповеститьОВыборе(СтруктураПараметров);
КонецПроцедуры

// //Для добавления обработчика события таблицы "Выбор":
//	ТаблицаПолейВыбора.УстановитьДействие("Выбор","ТЗВыбор");
//Для обработки данного события в форме процедуры прописывается отдельная процедура (НаКлиенте):
//&НаКлиенте
//Процедура ТЗВыбор(ТЗ, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//      //Код для обработки обработчика
//КонецПроцедуры