#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИзменитьКод(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКода", ЭтотОбъект);
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Код", ТекСтрока.Код);
	ОткрытьФорму("ОбщаяФорма.ФормаВводаНовогоКода", ПараметрыОткрытия,ЭтаФорма,,,,Оповещение);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПослеВыбораКода(Параметр, ДопПараметры) Экспорт
	
	УстановитьНовыйКод(Элементы.Список.ТекущиеДанные.Код, Параметр.Код);
	Элементы.Список.Обновить();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНовыйКод(СтарыйКод, НовыйКод)
	
	 СправочникСсылка = Справочники.Заметки.НайтиПоКоду(СтарыйКод);
	 СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	 СправочникОбъект.Код = НовыйКод;
	 СправочникОбъект.Записать();	
	 
КонецПроцедуры	
#КонецОбласти 

