
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Описание таблицы значений как реквизита
    МассивТипа = Новый Массив;
    МассивТипа.Добавить(Тип("ТаблицаЗначений"));
    
     // Добавление ТаблицыЗначений в массив реквизитов
    ОписаниеТипа = Новый ОписаниеТипов(МассивТипа);
    МассивРеквизитовФормы = Новый Массив;
    МассивРеквизитовФормы.Добавить(Новый РеквизитФормы("ТаблицаСотрудников", ОписаниеТипа, "", "ТЗСотр"));
    
     // Создание ТаблицыЗначений с описанием колонок
    КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
    ОписаниеСтроки_10 	= Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);  
   	ОписаниеСотрудника 	= Новый ОписаниеТипов("СправочникСсылка.Темы");

    ТЗ = Новый ТаблицаЗначений;
    ТЗ.Колонки.Добавить("Код"		, ОписаниеСтроки_10);
    ТЗ.Колонки.Добавить("Сотрудник"	, ОписаниеСотрудника);
    
     // Добавление в массив реквизитов колонок ТаблицыЗначений
    Для Каждого Колонка Из ТЗ.Колонки Цикл
        МассивРеквизитовФормы.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаСотрудников"));
    КонецЦикла;
    
     // Удаление - если таблица существует
    ЭлементТаблица = Элементы.Найти("ТаблицаСотрудников");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);
    Иначе
        ИзменитьРеквизиты(МассивРеквизитовФормы);
    КонецЕсли;
    
    // Добавление ТаблицыЗначений на форму
    ТаблицаПолейВыбора = Элементы.Добавить("ТЗСотр", Тип("ТаблицаФормы"));
    ТаблицаПолейВыбора.ПутьКДанным = "ТаблицаСотрудников";
    ТаблицаПолейВыбора.Отображение = ОтображениеТаблицы.Список;
    ТаблицаПолейВыбора.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; // Отключение командной панели
    
    Для Каждого Колонка Из ТЗ.Колонки Цикл

        НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "ТаблицаСотрудников." + Колонка.Имя;
        НовыйЭлемент.Ширина = 10;

    КонецЦикла;
    
     Строка = ТЗ.Добавить();
     Строка.Код = "45";
     Строка.Сотрудник = Справочники.Темы.НайтиПоКоду("000000004");
        
        // Передача ТаблицыЗначений в реквизит формы
    ЗначениеВРеквизитФормы(ТЗ, "ТаблицаСотрудников");
    
    //Для добавления обработчика события таблицы "Выбор":
	ТаблицаПолейВыбора.УстановитьДействие("Выбор","ТЗВыбор");

// При обращении к реквизиту получите ошибку: Переменная не определена
// Для чтения реквизита, который создан программно, используется метод РеквизитФормыВЗначение

	ТекущаяТаблица=РеквизитФормыВЗначение("ТаблицаСотрудников");

КонецПроцедуры

//Для обработки данного события в форме процедуры прописывается отдельная процедура (НаКлиенте):
&НаКлиенте
Процедура ТЗВыбор(ТЗ, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
      //Код для обработки обработчика
КонецПроцедуры