
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(Завершениеработы)

	МассивСтрок = Новый массив;

	Для Каждого СтрокаЭлемент Из таблицастрок Цикл
		МассивСтрок.Добавить(СтрокаЭлемент.Значение_li);
	КонецЦикла;

	Структурапараметров = Новый структура;
	Структурапараметров.вставить("вид", вид);
	Структурапараметров.вставить("тип", тип);
	Структурапараметров.Вставить("reversed"	, reversed);
	СтруктураПараметров.Вставить("start"	, start);
	СтруктураПараметров.Вставить("value"	, value);
	СтруктураПараметров.Вставить("Строки"	, МассивСтрок);
	
	ОповеститьОВыборе(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Вид = Перечисления.ВидыСписковHTML.Маркированный;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
